## 1. Создание и клонирование репозитория

Был создан репозиторий на сайте Github, который доступен последующей ссылке:
* https://www.github.com/ChinaGiza/DevOpsPrak2

При помощи команды `git clone https://github.com/ChinaGiza/DevOpsPrak2.git` был создана локальная копия данного репозитория.

Были созданы и заполнены такие файлы, как:
* `FIO.txt`
* `Text.txt`
* `Another.txt`

## 2. Ветка `feature/TASK-123`

При помощи команды `git checkout -b feature/TASK-123` была создана данная ветка.

В ветке `feature/TASK-123` файлы из ветки `main` были изменены.

После изменения каждого из файлов были выполнены следующие команды:
* `git add .` - команда, которая добавляет изменения из рабочего каталога в область "подготовки"
* `git commit -m <text>` - команда, которая сохраняет текущее состояние проекта в истории репозитория. В `<text>` можно указать текст описывающие изменения.

## 3. Ветка `bugfix/TASK-3321`

При помощи команды `git checkout -b bugfix/TASK-3321` была создана данная ветка.

В ветке `bugfix/TASK-3321` файлы из ветки `main` были изменены, но в строках отличных от `feature/TASK-123`.

После внесения изменений в каждый из файлов были выполнены следующие команды:
* `git add .`
* `git commit -m <text>`

## 4. Использование `git stash`

Шаги выполнения:
1. В ветке `bugfix/TASK-3321` были внесены изменения
2. Изменения были временно сохранены при помощи команды `git stash`
3. После переключение на ветку `feature/TASK-123` при помощи команды `git checkout feature/TASK-123`
4. В ветке `faeture/TASK-123` были внесены изменения
5. Переключение на ветку `bugfix/TASK-3321` при помощи команды `git checkout bugfix/TASK-3321`
6. Использование команды `git stash pop` для восстановления изменений

## 5. Использование `git push`

При помощи команды `git push origin feature/TASK-123` был загружена на удаленный репозиторий ветка `feature/TASK-123`

При помощи команды `git push origin bugfix/TASK-3321` был загружена на удаленный репозиторий ветка `bugfix/TASK-3321`

## 6. Использование `git merge`

При помощи команды `git merge feature/TASK-123` ветка `feature/TASK-123` была слита в ветку `main`.

При помощи команды `git merge bugfix/TASK-3321` ветка `bugfix/TASK-3321` была слита в ветку `main`.

Возникающие при сливании веток конфликты были разрешены вручную путем изменения файлов. 

## 7. Запрос на слияние

В удаленном репозитории был совершен запрос на слияние (pull request) ветки `bugfix/TASK-3321` в ветку `main`.

Текст комментария запроса на слияние:
``` TXT
Изменения:

- Внесены изменения в FIO.txt
- Внесены изменения в another.txt
- Внесены изменения в Text.txt
- Внесены дополнительные изменения для представления запроса на слияние

Разрешение конфликтов:

- Во всех трех файлах были конфликты. Они были решены вручную, путем редактирования самих файлов
```

После одобрения запроса ветка `bugfix/TASK-3321` была слита в ветку `main`.